---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.IfcExportElementTypeAs
source: html/bcc357a2-daff-00a4-2607-4f7da2f63cb0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.IfcExportElementTypeAs Property

"Export Type to IFC As"

## Syntax (C#)
```csharp
public static ForgeTypeId IfcExportElementTypeAs { get; }
```